Repository: ptudor/tudor-pcb
Catalog: swift/GerberKit/Sources/GerberKit/Resources/Diagnostics.xcstrings
Source language: en
Languages: af, am, ar, az, be, bg, bn, ca, cs, cy, da, de, de_at, de_ch, el, es, es_ar, es_mx, et, eu, fa, fi, fil, fr, fr_ca, ga, gl, gu, he, hi, hr, hu, hy, id, is, it, ja, ka, kk, km, kn, ko, ky, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, nb, ne, nl, or, pa, pl, pt, pt_br, ro, ru, si, sk, sl, sq, sr, sv, sw, ta, te, th, tr, uk, ur, vi, zh_hans, zh_hant, zu

source: Board bounds must be finite and ordered, with each dimension between 0.000001 and 1000000 mm.
af: Bordgrense moet eindig en georden wees, met elke afmeting tussen 0.000001 en 1000000 mm.
am: የቦርዱ ወሰኖች የተወሰነ እና የተደረደሩ መሆን አለባቸው፣ እያንዳንዱ ልኬት ከ0.000001 እስከ 1000000 ሚሜ መካከል መሆን አለበት።
ar: يجب أن تكون حدود اللوحة محدودة ومنظمة، بحيث يكون كل بُعد بين 0.000001 و 1000000 مم.
az: Lövhənin sərhədləri sonlu və nizamlı olmalı, hər bir ölçü 0.000001 ilə 1000000 mm arasında olmalıdır.
be: Межы платы павінны быць канечнымі і ўпарадкаванымі, з кожным вымярэннем ад 0,000001 да 1000000 мм.
bg: Границите на платка трябва да са крайни и подредени, като всяко измерение трябва да е в диапазона от 0,000001 до 1 000 000 mm.
bn: বোর্ডের সীমানা অবশ্যই সসীম ও বিন্যস্ত হতে হবে এবং এর প্রতিটি মাত্রা ০.০০০০০১ থেকে ১,০০০০০০ মিমি-এর মধ্যে থাকবে।
ca: Els límits del tauler han de ser finits i ordenats, amb cada dimensió entre 0,000001 i 1.000.000 mm.
cs: Rozměry desky musí být konečné a uspořádané, přičemž každý rozměr musí ležet v rozmezí od 0,000001 do 1 000 000 mm.
cy: Rhaid i ffiniau'r byrddau fod yn gyfyngedig ac yn drefnus, gyda phob dimensiwn rhwng 0.000001 a 1000000 mm.
da: Pladens grænser skal være endelige og ordnede, og hver dimension skal ligge mellem 0,000001 og 1 000 000 mm.
de: Die Abmessungen der Platine müssen endlich und geordnet sein, wobei jede Abmessung zwischen 0,000001 und 1 000 000 mm liegen muss.
de_at: Die Abmessungen der Platine müssen endlich und geordnet sein, wobei jede Dimension zwischen 0,000001 und 1000000 mm liegen muss.
de_ch: Die Abmessungen der Platine müssen endlich und geordnet sein, wobei jede Dimension zwischen 0,000001 und 1000000 mm liegen muss.
el: Τα όρια της πλακέτας πρέπει να είναι πεπερασμένα και ταξινομημένα, με κάθε διάσταση να κυμαίνεται μεταξύ 0,000001 και 1.000.000 mm.
es: Las dimensiones de la placa deben ser finitas y estar ordenadas, y cada dimensión debe estar comprendida entre 0,000001 y 1 000 000 mm.
es_ar: Las dimensiones del tablero deben ser finitas y estar ordenadas, y cada dimensión debe estar comprendida entre 0,000001 y 1 000 000 mm.
es_mx: Los límites del tablero deben ser finitos y estar ordenados, con cada dimensión comprendida entre 0,000001 y 1.000.000 mm.
et: Plaadi mõõtmed peavad olema piiratud ja järjestatud, kusjuures iga mõõde peab jääma vahemikku 0,000001–1 000 000 mm.
eu: Taularen mugak finituak eta ordenatuak izan behar dira, dimentsio bakoitza 0,000001 eta 1 000 000 mm artean egon behar delarik.
fa: مرزهای تخته باید محدود و منظم باشند و هر بُعد بین 0.000001 تا 1000000 میلی‌متر باشد.
fi: Levyn rajojen on oltava äärellisiä ja järjestettyjä, ja kunkin ulottuvuuden on oltava välillä 0,000001–1 000 000 mm.
fil: Ang mga hangganan ng board ay dapat may hangganan at maayos, na ang bawat dimensyon ay nasa pagitan ng 0.000001 at 1000000 mm.
fr: Les dimensions de la planche doivent être finies et ordonnées, chaque dimension devant être comprise entre 0,000001 et 1 000 000 mm.
fr_ca: Les limites de la carte doivent être finies et ordonnées, chaque dimension étant comprise entre 0,000001 et 1000000 mm.
ga: Ní mór teorainneacha an bhoird a bheith críochta agus ordaithe, agus gach toise idir 0.000001 agus 1000000 mm.
gl: Os límites da placa deben ser finitos e ordenados, con cada dimensión entre 0,000001 e 1000000 mm.
gu: બોર્ડ બાઉન્ડ્રી મર્યાદિત અને ક્રમબદ્ધ હોવી જોઈએ, દરેક પરિમાણ 0.000001 અને 1000000 મીમી વચ્ચે હોવું જોઈએ.
he: גבולות הלוח חייבים להיות סופיים ומסודרים, כאשר כל ממד בין 0.000001 ל-1000000 מ"מ.
hi: बोर्ड की सीमाएँ परिमित और क्रमबद्ध होनी चाहिए, जिसमें प्रत्येक आयाम 0.000001 और 1000000 मिमी के बीच हो।
hr: Granice ploče moraju biti konačne i uređene, sa svakom dimenzijom između 0,000001 i 1000000 mm.
hu: A lap határainak végesnek és rendezettnek kell lenniük, és minden dimenziójának 0,000001 és 1 000 000 mm között kell lennie.
hy: Տախտակի սահմանները պետք է լինեն վերջավոր և կարգավորված, յուրաքանչյուր չափսը պետք է լինի 0.000001-ից մինչև 1000000 մմ միջև։
id: Batas papan harus terbatas dan terurut, dengan setiap dimensi antara 0,000001 dan 1.000.000 mm.
is: Mörk borðsins verða að vera endanleg og skipulögð, þar sem hver vídd verður að vera á milli 0,000001 og 1000000 mm.
it: I limiti della tavola devono essere finiti e ordinati, con ciascuna dimensione compresa tra 0,000001 e 1.000.000 mm.
ja: ボードの境界は有限かつ順序付けられていなければならず、各次元の値は0.000001～1000000 mmの範囲でなければなりません。
ka: დაფის საზღვრები უნდა იყოს სასრული და დალაგებული, თითოეული განზომილებით 0.000001-დან 1000000 მმ-მდე.
kk: Тақта шекаралары шекті және реттелген болуы керек, әрбір өлшемі 0,000001 және 1000000 мм аралығында болуы керек.
km: ព្រំដែន​ក្តារ​ត្រូវតែ​មាន​កំណត់ និង​មាន​របៀបរៀបរយ ដោយ​វិមាត្រ​នីមួយៗ​ស្ថិត​នៅ​ចន្លោះ 0.000001 និង 1000000 ម.ម។
kn: ಬೋರ್ಡ್ ಬೌಂಡರಿಗಳು ಸೀಮಿತವಾಗಿರಬೇಕು ಮತ್ತು ಕ್ರಮಬದ್ಧವಾಗಿರಬೇಕು, ಪ್ರತಿ ಆಯಾಮವು 0.000001 ಮತ್ತು 1000000 ಮಿಮೀ ನಡುವೆ ಇರಬೇಕು.
ko: 보드의 경계는 유한하고 순서가 정해져 있어야 하며, 각 차원의 값은 0.000001~1000000 mm 사이여야 합니다.
ky: Такталардын чек аралары чектүү жана иреттүү болушу керек, ар бир өлчөм 0,000001 жана 1000000 мм ортосунда болушу керек.
lo: ຂອບເຂດຂອງກະດານຕ້ອງມີຂອບເຂດຈຳກັດ ແລະ ເປັນລຳດັບ, ໂດຍແຕ່ລະມິຕິມີຂະໜາດລະຫວ່າງ 0.000001 ແລະ 1000000 ມມ.
lt: Plokštės ribos turi būti baigtinės ir išdėstytos tam tikra tvarka, o kiekvienas matmuo turi būti nuo 0,000001 iki 1 000 000 mm.
lv: Plāksnes izmēriem jābūt ierobežotiem un sakārtotiem, katram izmēram atrodoties diapazonā no 0,000001 līdz 1 000 000 mm.
mk: Границите на таблите мора да бидат конечни и подредени, со секоја димензија помеѓу 0,000001 и 1000000 mm.
ml: ബോർഡ് അതിരുകൾ പരിമിതവും ക്രമീകൃതവുമായിരിക്കണം, ഓരോ അളവും 0.000001 നും 1000000 മില്ലിമീറ്ററിനും ഇടയിലായിരിക്കണം.
mn: Самбарын хил хязгаар нь хязгаарлагдмал бөгөөд эрэмбэлэгдсэн байх ёстой бөгөөд хэмжээс бүр нь 0.000001-ээс 1000000 мм-ийн хооронд байна.
mr: बोर्डच्या सीमा निश्चित आणि सुव्यवस्थित असाव्यात, आणि प्रत्येक माप 0.000001 ते 1000000 मिमी दरम्यान असावे.
ms: Batasan papan mestilah terhad dan teratur, dengan setiap dimensi antara 0.000001 dan 1000000 mm.
mt: Il-limiti tal-bord iridu jkunu finiti u ordnati, b'kull dimensjoni bejn 0.000001 u 1000000 mm.
my: ဘုတ်ဘောင်များသည် အကန့်အသတ်ရှိပြီး အစီအစဉ်တကျဖြစ်ရမည်၊ အတိုင်းအတာတစ်ခုစီသည် 0.000001 မှ 1000000 မီလီမီတာအကြားရှိရမည်။
nb: Platens dimensjoner må være endelige og ordnede, og hver dimensjon må ligge mellom 0,000001 og 1 000 000 mm.
ne: बोर्ड सीमाहरू सीमित र क्रमबद्ध हुनुपर्छ, प्रत्येक आयाम ०.०००००१ र १००००००० मिमी बीचको हुनुपर्छ।
nl: De afmetingen van het bord moeten eindig en geordend zijn, waarbij elke afmeting tussen 0,000001 en 1.000.000 mm moet liggen.
or: ବୋର୍ଡ ସୀମା ସୀମିତ ଏବଂ କ୍ରମବଦ୍ଧ ହେବା ଆବଶ୍ୟକ, ପ୍ରତ୍ୟେକ ପରିମାଣ 0.000001 ଏବଂ 1000000 mm ମଧ୍ୟରେ ରହିବା ଉଚିତ।
pa: ਬੋਰਡ ਸੀਮਾਵਾਂ ਸੀਮਤ ਅਤੇ ਕ੍ਰਮਬੱਧ ਹੋਣੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ, ਹਰੇਕ ਮਾਪ 0.000001 ਅਤੇ 1000000 ਮਿਲੀਮੀਟਰ ਦੇ ਵਿਚਕਾਰ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ।
pl: Wymiary planszy muszą być skończone i uporządkowane, przy czym każdy wymiar musi mieścić się w przedziale od 0,000001 do 1 000 000 mm.
pt: As dimensões da placa devem ser finitas e ordenadas, devendo cada dimensão situar-se entre 0,000001 e 1 000 000 mm.
pt_br: Os limites da placa devem ser finitos e ordenados, com cada dimensão entre 0,000001 e 1.000.000 mm.
ro: Limitele plăcii trebuie să fie finite și ordonate, fiecare dimensiune fiind cuprinsă între 0,000001 și 1 000 000 mm.
ru: Размеры рабочей области должны быть конечными и упорядоченными, причем каждое измерение должно находиться в диапазоне от 0,000001 до 1 000 000 мм.
si: පුවරු සීමාවන් සීමිත විය යුතු අතර අනුපිළිවෙලට සකස් කළ යුතු අතර, එක් එක් මානය 0.000001 සහ 1000000 mm අතර විය යුතුය.
sk: Rozmery dosky musia byť konečné a usporiadané, pričom každý rozmer sa musí pohybovať v rozmedzí od 0,000001 do 1 000 000 mm.
sl: Meje plošče morajo biti končne in urejene, pri čemer mora biti vsaka dimenzija v razponu od 0,000001 do 1 000 000 mm.
sq: Kufijtë e dërrasave duhet të jenë të fundëm dhe të renditur, me çdo dimension midis 0.000001 dhe 1000000 mm.
sr: Границе плоче морају бити коначне и поређане, при чему свака димензија мора бити између 0,000001 и 1000000 мм.
sv: Plattans mått måste vara ändliga och ordnade, där varje dimension ligger mellan 0,000001 och 1 000 000 mm.
sw: Mipaka ya bodi lazima iwe na kikomo na mpangilio, kila kipimo kikiwa kati ya 0.000001 na 1000000 mm.
ta: பலகையின் எல்லைகள் வரையறுக்கப்பட்டதாகவும் வரிசைப்படுத்தப்பட்டதாகவும் இருக்க வேண்டும், மேலும் ஒவ்வொரு பரிமாணமும் 0.000001 முதல் 1000000 மிமீ வரை இருக்க வேண்டும்.
te: బోర్డు సరిహద్దులు ఖచ్చితంగా మరియు క్రమబద్ధంగా ఉండాలి, ప్రతి కొలత 0.000001 మరియు 1000000 mm మధ్య ఉండాలి.
th: ขอบเขตของแผ่นกระดานต้องมีค่าที่แน่นอนและเรียงลำดับ โดยแต่ละมิติต้องมีขนาดอยู่ระหว่าง 0.000001 ถึง 1,000,000 มิลลิเมตร
tr: Levha sınırları sonlu ve sıralı olmalı; her bir boyut 0,000001 ile 1.000.000 mm arasında olmalıdır.
uk: Межі дошки повинні бути скінченними та впорядкованими, причому кожен розмір має знаходитися в діапазоні від 0,000001 до 1 000 000 мм.
ur: بورڈ کی حدود 0.000001 اور 1000000 ملی میٹر کے درمیان ہر طول و عرض کے ساتھ، محدود اور ترتیب شدہ ہونی چاہیے۔
vi: Các cạnh của tấm ván phải hữu hạn và được sắp xếp theo thứ tự, với mỗi chiều nằm trong khoảng từ 0,000001 đến 1000000 mm.
zh_hans: 电路板边界必须是有限的且有序的，每个维度的范围应在0.000001至1000000毫米之间。
zh_hant: 電路板邊界必須是有限且有序的，且各維度的範圍須介於 0.000001 至 1000000 毫米之間。
zu: Imingcele yebhodi kumele ibe nomkhawulo futhi ihlelwe kahle, ubukhulu ngabunye buphakathi kuka-0.000001 no-1000000 mm.

source: Board thickness must be finite, positive, and at most 1000000 mm.
af: Die borddikte moet eindig, positief en hoogstens 1000000 mm wees.
am: የቦርዱ ውፍረት የተወሰነ፣ አዎንታዊ እና ቢበዛ 1000000 ሚሜ መሆን አለበት።
ar: يجب أن يكون سمك اللوح محدودًا وموجبًا، وبحد أقصى 1000000 مم.
az: Lövhənin qalınlığı sonlu, müsbət və maksimum 1000000 mm olmalıdır.
be: Таўшчыня дошкі павінна быць канечнай, дадатнай і не большай за 1000000 мм.
bg: Дебелината на плочата трябва да е крайна, положителна и не по-голяма от 1 000 000 mm.
bn: বোর্ডের পুরুত্ব অবশ্যই সসীম, ধনাত্মক এবং সর্বাধিক ১,০০০,০০০ মিমি হতে হবে।
ca: El gruix de la placa ha de ser finit, positiu i com a màxim de 1.000.000 mm.
cs: Tloušťka desky musí být konečná, kladná a nesmí přesáhnout 1 000 000 mm.
cy: Rhaid i drwch y bwrdd fod yn gyfyngedig, yn bositif, ac ar y mwyaf yn 1000000 mm.
da: Pladens tykkelse skal være et endeligt, positivt tal og højst 1 000 000 mm.
de: Die Plattendicke muss endlich und positiv sein und darf höchstens 1.000.000 mm betragen.
de_at: Die Plattendicke muss endlich, positiv und höchstens 1000000 mm sein.
de_ch: Die Plattendicke muss endlich, positiv und höchstens 1000000 mm betragen.
el: Το πάχος της σανίδας πρέπει να είναι πεπερασμένο, θετικό και να μην υπερβαίνει τα 1.000.000 mm.
es: El grosor de la tabla debe ser finito, positivo y no superior a 1 000 000 mm.
es_ar: El espesor de la tabla debe ser finito, positivo y no superar los 1 000 000 mm.
es_mx: El espesor de la placa debe ser finito, positivo y como máximo de 1.000.000 mm.
et: Plaadi paksus peab olema piiratud, positiivne ja maksimaalselt 1 000 000 mm.
eu: Taularen lodiera finitua, positiboa eta gehienez 1000000 mm-koa izan behar da.
fa: ضخامت تخته باید محدود، مثبت و حداکثر ۱۰۰۰۰۰۰ میلی‌متر باشد.
fi: Levyn paksuuden on oltava äärellinen, positiivinen ja enintään 1 000 000 mm.
fil: Ang kapal ng board ay dapat may hangganan, positibo, at hindi hihigit sa 1000000 mm.
fr: L'épaisseur de la planche doit être finie, positive et inférieure ou égale à 1 000 000 mm.
fr_ca: L'épaisseur de la carte doit être finie, positive et au plus égale à 1 000 000 mm.
ga: Ní mór tiús an bhoird a bheith críochta, dearfach, agus 1000000 mm ar a mhéad.
gl: O grosor da placa debe ser finito, positivo e como máximo de 1000000 mm.
gu: બોર્ડની જાડાઈ મર્યાદિત, ધન અને વધુમાં વધુ 1000000 મીમી હોવી જોઈએ.
he: עובי הלוח חייב להיות סופי, חיובי, ולכל היותר 1000000 מ"מ.
hi: बोर्ड की मोटाई परिमित, धनात्मक और अधिकतम 1000000 मिमी होनी चाहिए।
hr: Debljina ploče mora biti konačna, pozitivna i najviše 1000000 mm.
hu: A lemez vastagságának végesnek, pozitívnak és legfeljebb 1 000 000 mm-nek kell lennie.
hy: Տախտակի հաստությունը պետք է լինի վերջավոր, դրական և առավելագույնը 1000000 մմ։
id: Ketebalan papan harus berupa bilangan terbatas, bernilai positif, dan paling banyak 1.000.000 mm.
is: Þykkt borðsins verður að vera endanleg, jákvæð og í mesta lagi 1000000 mm.
it: Lo spessore della scheda deve essere un numero finito, positivo e non superiore a 1000000 mm.
ja: 板の厚さは有限で、正の値であり、かつ1000000 mm以下でなければなりません。
ka: დაფის სისქე უნდა იყოს სასრული, დადებითი და მაქსიმუმ 1000000 მმ.
kk: Тақтаның қалыңдығы шекті, оң және ең көбі 1000000 мм болуы керек.
km: កម្រាស់ក្តារត្រូវតែមានកំណត់ វិជ្ជមាន និងមិនលើស 1000000 មម។
kn: ಬೋರ್ಡ್ ದಪ್ಪವು ಸೀಮಿತವಾಗಿರಬೇಕು, ಧನಾತ್ಮಕವಾಗಿರಬೇಕು ಮತ್ತು ಗರಿಷ್ಠ 1000000 ಮಿಮೀ ಆಗಿರಬೇಕು.
ko: 판의 두께는 유한하고 양수여야 하며, 최대 1,000,000 mm이어야 합니다.
ky: Тактанын калыңдыгы чектүү, оң жана эң көп дегенде 1000000 мм болушу керек.
lo: ຄວາມໜາຂອງກະດານຕ້ອງມີຂອບເຂດຈຳກັດ, ເປັນບວກ, ແລະ ບໍ່ເກີນ 1000000 ມມ.
lt: Plokštės storis turi būti ribotas, teigiamas ir ne didesnis kaip 1 000 000 mm.
lv: Plātnes biezumam jābūt galīgam, pozitīvam un ne lielākam par 1 000 000 mm.
mk: Дебелината на плочата мора да биде конечна, позитивна и најмногу 1000000 mm.
ml: ബോർഡിന്റെ കനം പരിമിതവും, പോസിറ്റീവും, പരമാവധി 1000000 മില്ലിമീറ്ററും ആയിരിക്കണം.
mn: Самбарын зузаан нь хязгаарлагдмал, эерэг, хамгийн ихдээ 1000000 мм байх ёстой.
mr: बोर्डची जाडी मर्यादित, सकारात्मक आणि जास्तीत जास्त 1000000 मिमी असणे आवश्यक आहे.
ms: Ketebalan papan mestilah terhingga, positif, dan tidak lebih daripada 1000000 mm.
mt: Il-ħxuna tal-bord trid tkun finita, pożittiva, u mhux aktar minn 1000000 mm.
my: ဘုတ်အထူသည် အကန့်အသတ်ရှိရမည်ဖြစ်ပြီး၊ အပေါင်းဖြစ်ရမည်၊ နှင့် အများဆုံး 1000000 မီလီမီတာ ရှိရမည်။
nb: Platens tykkelse må være et endelig, positivt tall og høyst 1 000 000 mm.
ne: बोर्डको मोटाई सीमित, धनात्मक र बढीमा १००००० मिमी हुनुपर्छ।
nl: De dikte van de plaat moet eindig en positief zijn, en mag maximaal 1.000.000 mm bedragen.
or: ବୋର୍ଡ ଘନତା ସୀମିତ, ଧନାତ୍ମକ ଏବଂ ସର୍ବାଧିକ 1000000 ମିମି ହେବା ଆବଶ୍ୟକ।
pa: ਬੋਰਡ ਦੀ ਮੋਟਾਈ ਸੀਮਤ, ਸਕਾਰਾਤਮਕ, ਅਤੇ ਵੱਧ ਤੋਂ ਵੱਧ 1000000 ਮਿਲੀਮੀਟਰ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ।
pl: Grubość płyty musi być skończona, dodatnia i wynosić co najwyżej 1 000 000 mm.
pt: A espessura da placa deve ser finita, positiva e, no máximo, 1 000 000 mm.
pt_br: A espessura da placa deve ser finita, positiva e, no máximo, 1.000.000 mm.
ro: Grosimea plăcii trebuie să fie finită, pozitivă și să nu depășească 1 000 000 mm.
ru: Толщина доски должна быть конечной, положительной и не превышать 1 000 000 мм.
si: පුවරු ඝණකම සීමිත, ධනාත්මක සහ උපරිම වශයෙන් 1000000 mm විය යුතුය.
sk: Hrúbka dosky musí byť konečná, kladná a nesmie presiahnuť 1 000 000 mm.
sl: Debelina plošče mora biti končna, pozitivna in največ 1 000 000 mm.
sq: Trashësia e pllakës duhet të jetë e kufizuar, pozitive dhe maksimumi 1000000 mm.
sr: Дебљина плоче мора бити коначна, позитивна и највише 1000000 мм.
sv: Skivans tjocklek måste vara ett ändligt, positivt tal och högst 1 000 000 mm.
sw: Unene wa bodi lazima uwe na kikomo, chanya, na usiozidi 1000000 mm.
ta: பலகையின் தடிமன் வரையறுக்கப்பட்டதாகவும், நேர்மறையாகவும், அதிகபட்சமாக 1000000 மிமீ ஆகவும் இருக்க வேண்டும்.
te: బోర్డు మందం పరిమితంగా, ధనాత్మకంగా మరియు గరిష్టంగా 1000000 మిమీ ఉండాలి.
th: ความหนาของแผ่นกระดานต้องมีค่าจำกัด เป็นค่าบวก และไม่เกิน 1,000,000 มิลลิเมตร
tr: Levha kalınlığı sonlu, pozitif ve en fazla 1.000.000 mm olmalıdır.
uk: Товщина дошки повинна бути скінченною, додатною і не перевищувати 1 000 000 мм.
ur: بورڈ کی موٹائی محدود، مثبت، اور زیادہ سے زیادہ 1000000 ملی میٹر ہونی چاہیے۔
vi: Độ dày của tấm ván phải là hữu hạn, dương và tối đa là 1000000 mm.
zh_hans: 板材厚度必须为有限的正数，且不超过1000000毫米。
zh_hant: 板材厚度必須為有限的正數，且不得超過 1000000 公釐。
zu: Ubukhulu bebhodi kumele bube nomkhawulo, bube buhle, futhi bube okungenazikululeko kwe-1000000 mm.

source: Choose a fabrication board: %@
af: Kies 'n vervaardigingsbord: %@
am: የማምረቻ ሰሌዳ ይምረጡ፦ %@
ar: اختر لوحة تصنيع: %@
az: İstehsal lövhəsi seçin: %@
be: Выберыце плату для вырабу: %@
bg: Изберете платка за изработка: %@
bn: একটি ফ্যাব্রিকেশন বোর্ড বেছে নিন: %@
ca: Trieu una placa de fabricació: %@
cs: Vyberte si desku pro výrobu: %@
cy: Dewiswch fwrdd gwneuthuriad: %@
da: Vælg et fremstillingsbræt: %@
de: Wählen Sie eine Herstellungsplatte aus: %@
de_at: Wählen Sie eine Fertigungsplatine: %@
de_ch: Wählen Sie eine Fertigungsplatine: %@
el: Επιλέξτε μια πλακέτα κατασκευής: %@
es: Elige una placa de fabricación: %@
es_ar: Elegir una placa de fabricación: %@
es_mx: Seleccione una placa de fabricación: %@
et: Vali valmistusplaat: %@
eu: Aukeratu fabrikazio-taula bat: %@
fa: یک برد ساخت انتخاب کنید: %@
fi: Valitse valmistusalusta: %@
fil: Pumili ng board para sa paggawa: %@
fr: Choisissez une carte de fabrication : %@
fr_ca: Choisissez une carte de production : %@
ga: Roghnaigh bord monaraíochta: %@
gl: Escolla unha placa de fabricación: %@
gu: ફેબ્રિકેશન બોર્ડ પસંદ કરો: %@
he: בחר לוח ייצור: %@
hi: एक फैब्रिकेशन बोर्ड चुनें: %@
hr: Odaberite ploču za izradu: %@
hu: Válasszon ki egy gyártási táblát: %@
hy: Ընտրեք արտադրական տախտակ՝ %@
id: Pilih papan fabrikasi: %@
is: Veldu framleiðsluborð: %@
it: Scegli una scheda di fabbricazione: %@
ja: 製作用ボードを選択してください：%@
ka: აირჩიეთ დაფა: %@
kk: Өндіріс тақтасын таңдаңыз: %@
km: ជ្រើសរើសក្តារផលិត៖ %@
kn: ಫ್ಯಾಬ್ರಿಕೇಶನ್ ಬೋರ್ಡ್ ಆಯ್ಕೆಮಾಡಿ: %@
ko: 제작용 보드를 선택하세요: %@
ky: Жасалма тактасын тандаңыз: %@
lo: ເລືອກກະດານຜະລິດ: %@
lt: Pasirinkite gamybos lentą: %@
lv: Izvēlieties izgatavošanas plāksni: %@
mk: Изберете табла за изработка: %@
ml: ഒരു ഫാബ്രിക്കേഷൻ ബോർഡ് തിരഞ്ഞെടുക്കുക: %@
mn: Үйлдвэрлэлийн самбар сонгоно уу: %@
mr: फॅब्रिकेशन बोर्ड निवडा: %@
ms: Pilih papan fabrikasi: %@
mt: Agħżel bord tal-fabbrikazzjoni: %@
my: ထုတ်လုပ်ရေးဘုတ်တစ်ခုကို ရွေးချယ်ပါ- %@
nb: Velg et produksjonsbrett: %@
ne: फेब्रिकेशन बोर्ड छनौट गर्नुहोस्: %@
nl: Kies een fabricagebord: %@
or: ଏକ ଫେବ୍ରିକେସନ୍ ବୋର୍ଡ ବାଛନ୍ତୁ: %@
pa: ਇੱਕ ਫੈਬਰੀਕੇਸ਼ਨ ਬੋਰਡ ਚੁਣੋ: %@
pl: Wybierz płytkę drukowaną: %@
pt: Escolha uma placa de fabricação: %@
pt_br: Escolha uma placa de fabricação: %@
ro: Alegeți o placă de fabricație: %@
ru: Выберите печатную плату для производства: %@
si: නිෂ්පාදන පුවරුවක් තෝරන්න: %@
sk: Vyberte si dosku na výrobu: %@
sl: Izberite ploščo za izdelavo: %@
sq: Zgjidhni një pllakë fabrikimi: %@
sr: Изаберите плочу за израду: %@
sv: Välj en tillverkningsplatta: %@
sw: Chagua ubao wa utengenezaji: %@
ta: ஒரு உற்பத்திப் பலகையைத் தேர்ந்தெடுக்கவும்: %@
te: ఫ్యాబ్రికేషన్ బోర్డును ఎంచుకోండి: %@
th: เลือกแผงวงจรการผลิต: %@
tr: Bir yapım panosu seçin: %@
uk: Оберіть плату для виготовлення: %@
ur: تیاری کے لیے بورڈ کا انتخاب کریں: %@
vi: Chọn bo mạch chế tạo: %@
zh_hans: 选择一块制造板：%@
zh_hant: 選擇一個製作板：%@
zu: Khetha ibhodi lokukhiqiza: %@

source: Could not allocate the board texture canvas.
af: Kon nie die bordtekstuur-doek toewys nie.
am: የቦርዱን ሸካራነት ሸራ መመደብ አልተቻለም።
ar: تعذر تخصيص مساحة نسيج اللوحة.
az: Lövhənin tekstura kətanını ayırmaq mümkün olmadı.
be: Не атрымалася вылучыць палатно тэкстуры дошкі.
bg: Не можа да се разпредели платното за текстурата на дъската.
bn: বোর্ড টেক্সচার ক্যানভাসটি বরাদ্দ করা যায়নি।
ca: No s'ha pogut assignar el llenç de textura del tauler.
cs: Nepodařilo se alokovat plátno textury desky.
cy: Methu dyrannu cynfas gwead y bwrdd.
da: Det var ikke muligt at allokere teksturkanvas for kortet.
de: Die Textur-Leinwand des Schaltungsbretts konnte nicht zugewiesen werden.
de_at: Die Board-Textur-Leinwand konnte nicht zugewiesen werden.
de_ch: Die Textur-Leinwand für das Board konnte nicht zugewiesen werden.
el: Δεν ήταν δυνατή η εκχώρηση χώρου για τον καμβά της υφής της πλακέτας.
es: No se ha podido asignar el lienzo de la textura del tablero.
es_ar: No se pudo asignar el lienzo de textura del tablero.
es_mx: No se pudo asignar el lienzo de textura del tablero.
et: Plaadi tekstuuri lõuendit ei õnnestunud eraldada.
eu: Ezin izan da taularen ehunduraren mihisea esleitu.
fa: نتوانستم بوم بافت تخته را اختصاص دهم.
fi: Levyn tekstuuripohjaa ei voitu varata.
fil: Hindi ma-allocate ang texture canvas ng board.
fr: Impossible d'allouer le canevas de texture de la carte.
fr_ca: Impossible d'allouer le canevas de texture de la carte.
ga: Níorbh fhéidir chanbhás uigeachta an bhoird a leithdháileadh.
gl: Non se puido asignar o lenzo de textura do taboleiro.
gu: બોર્ડ ટેક્સચર કેનવાસ ફાળવી શકાયું નથી.
he: לא ניתן היה להקצות את בד הציור של מרקם הלוח.
hi: बोर्ड टेक्सचर कैनवास आवंटित नहीं किया जा सका।
hr: Nije moguće dodijeliti platno teksture ploče.
hu: Nem sikerült allokálni a táblás textúra vásznát.
hy: Հնարավոր չէ հատկացնել տախտակի հյուսվածքի կտավը։
id: Tidak dapat mengalokasikan kanvas tekstur papan.
is: Gat ekki úthlutað áferðarstriga borðsins.
it: Impossibile allocare il canvas della texture della scheda.
ja: ボードのテクスチャ・キャンバスを割り当てることができませんでした。
ka: დაფის ტექსტურის ტილოს გამოყოფა ვერ მოხერხდა.
kk: Тақта текстурасы кенви бөлу мүмкін болмады.
km: មិនអាចបែងចែកផ្ទាំងក្រងាលផ្ទាំងលាបក្តារបានទេ។
kn: ಬೋರ್ಡ್ ಟೆಕ್ಸ್ಚರ್ ಕ್ಯಾನ್ವಾಸ್ ಅನ್ನು ಹಂಚಿಕೆ ಮಾಡಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ.
ko: 보드 텍스처 캔버스를 할당할 수 없습니다.
ky: Тактанын текстура холстун бөлүп көрсөтүү мүмкүн болгон жок.
lo: ບໍ່ສາມາດຈັດສັນຜ້າໃບໂຄງສ້າງກະດານໄດ້.
lt: Nepavyko paskirstyti plokštės tekstūros drobės.
lv: Neizdevās piešķirt tekstūras audeklu.
mk: Не може да се додели платното со текстура на таблата.
ml: ബോർഡ് ടെക്സ്ചർ ക്യാൻവാസ് അനുവദിക്കാൻ കഴിഞ്ഞില്ല.
mn: Самбарын текстур даавууг хуваарилж чадсангүй.
mr: बोर्ड टेक्सचर कॅनव्हास वाटप करता आला नाही.
ms: Tidak dapat memperuntukkan kanvas tekstur papan.
mt: Ma setgħetx tiġi allokata l-kanvas tan-nisġa tal-bord.
my: ဘုတ် texture canvas ကို သတ်မှတ်သတ်မှတ်၍မရပါ။
nb: Det var ikke mulig å tildele lerretet for kortteksturen.
ne: बोर्ड टेक्सचर क्यानभास छुट्याउन सकिएन।
nl: Het canvas voor de textuur van het bord kon niet worden toegewezen.
or: ବୋର୍ଡ ଟେକ୍ସଚର୍ କାନଭାସ୍ ଆବଣ୍ଟନ କରିପାରିଲା ନାହିଁ।
pa: ਬੋਰਡ ਟੈਕਸਚਰ ਕੈਨਵਸ ਨਿਰਧਾਰਤ ਨਹੀਂ ਕੀਤਾ ਜਾ ਸਕਿਆ।
pl: Nie udało się przydzielić obszaru roboczego tekstury płyty.
pt: Não foi possível alocar a tela da textura do tabuleiro.
pt_br: Não foi possível alocar a tela de textura da placa.
ro: Nu s-a putut aloca spațiul de lucru pentru textura plăcii.
ru: Не удалось выделить полотно для текстуры платы.
si: පුවරු වයනය කැන්වසය වෙන් කිරීමට නොහැකි විය.
sk: Nepodarilo sa alokovať plátno textúry dosky.
sl: Teksturnega platna za ploščo ni bilo mogoče dodeliti.
sq: Nuk mund të caktohej kanavaca e teksturës së tabelës.
sr: Није могуће доделити платно за текстуру плоче.
sv: Det gick inte att allokera texturcanvassen för kortet.
sw: Haikuweza kutenga turubai ya umbile la ubao.
ta: பலகையின் டெக்ஸ்சர் கேன்வாஸை ஒதுக்கீடு செய்ய முடியவில்லை.
te: బోర్డ్ టెక్స్చర్ కాన్వాస్‌ను కేటాయించలేకపోయింది.
th: ไม่สามารถจัดสรรผืนผ้าใบสำหรับพื้นผิวของกระดานได้
tr: Kart doku tuvaline yer ayırılamadı.
uk: Не вдалося виділити полотно для текстури плати.
ur: بورڈ ٹیکسچر کینوس کو مختص نہیں کیا جا سکا۔
vi: Không thể cấp phát khung vẽ họa tiết cho bảng.
zh_hans: 无法分配棋盘纹理画布。
zh_hant: 無法分配棋盤紋理畫布。
zu: Ayikwazanga ukwaba indwangu yokuthungwa kwebhodi.
